---
kind: property
id: P:Autodesk.Revit.DB.Structure.RebarBendingDetailType.SegmentLengthDimensionsEnabled
source: html/9335f7d5-2217-32e4-e7f8-c978c79692c9.htm
---
# Autodesk.Revit.DB.Structure.RebarBendingDetailType.SegmentLengthDimensionsEnabled Property

Identifies if any segment length dimensions will be shown or not.

## Syntax (C#)
```csharp
public bool SegmentLengthDimensionsEnabled { get; set; }
```